;; 1. Аргументи не обчислюються перед тим, як вони були відправлені в тіло макроса;
;; 2. Тіло макросів обчислюється відповідно до звичайних правил Clojure;
;; 3. Дані, які повертаються макросом, негайно обчислюються в контексті простору імен,
;;    в якому був викликаний макрос і результат цього обчислення віддається назовні
;;    при виклику цього макроса.

(defn triplet-fn [a b c]
    (list a b c))

(defmacro triplet-macro-1 [a b c]
    (list list a b c))

(defmacro triplet-macro-2 [a b c]
    `(list ~a ~b ~c))

(println (triplet-fn 1 2 3)) ; (1 2 3)
(println (triplet-macro-1 1 2 3)) ; (1 2 3)
(println (triplet-macro-2 1 2 3)) ; (1 2 3)
