/*
  У нас є масив з елементами та іншими
  масивами — вкладеність може бути будь-якою.
  Потрібно усунути вкладеність, зберігши черговість
  елементів.
*/

/**
 * Складність за часом — `O(n)`
 * Складність за пам'яттю — `О(n)`
 */
const flat = (arrays) => {
  const result = [];

  for (const item of arrays) {
    if (Array.isArray(item)) {
      result.push(...flat(item));
    } else {
      result.push(item);
    }
  }

  return result;
};

const sentences = [
  ['Це речення'],
  'Це вже інше речення',
  ['Тут є масив', ['в яком є масив', ['в яком є масив']]],
]

console.log(flat(sentences)); // ['Це речення', 'Це вже інше речення', 'Тут є масив', 'в яком є масив', 'в яком є масив']
